<html>
  <head>
    
  </head>
  <body>
    TEOU, une application qui retourne la localisation de l'appareil suite &#224; 
    la r&#233;ception d'un SMS &quot;teou&quot;.<br>La r&#233;ponse sera sous la 
    forme d'un SMS &quot;suila&quot; avec le lien vers la carte &quot;Open Street Map&quot; et la 
    position de l'appareil.<br><br>Le syst&#232;me de localisation ne sera activ&#233;e 
    que suite au SMS, la batterie de l'appareil sera ainsi pr&#233;serv&#233;e.<br>De 
    m&#234;me, cette application fonctionne sans connexion &#224; l&#8217;internet pour 
    fournir la position de l'appareil.<br><br>Une personne (qui n'a pas 
    install&#233; l'application TEOU sur son smartphone) peut conna&#238;tre votre 
    position en envoyant simplement un SMS &quot;teou&quot; &#224; votre appareil.<br>Il 
    recevra en retour le SMS &quot;suila&quot; suivi du lien de votre position.<br>Il 
    lui suffira de &quot;cliquer&quot; sur le lien pour voir la carte et votre position 
    dans le navigateur de son appareil connect&#233; &#224; l&#8217;internet.<br><br>L'application 
    affiche automatiquement la carte &quot;Open Street Map&quot; suite &#224; la r&#233;ception du 
    SMS &quot;suila&quot; (si l'appareil dispose d'une connexion &#224; l&#8217;internet).<br><br>L'application 
    dispose en plus d'une interface pour visualiser les r&#233;ponses de demande de 
    localisation<br>Chaque position appel&#233;e &quot;lieu&quot; dans l'application est 
    historis&#233;e dans l'espace de stockage de l'appareil.<br>il sera 
    possible de renommer le lieu, de le supprimer, et m&#234;me de l'envoyer par 
    SMS &#224; qui vous voulez.<br><br>AUTORISATION<br>Pour b&#233;n&#233;ficier de 
    toutes les fonctionnalit&#233;s, il faudra autoriser l'application &#224; :<br>- 
    Contacts<br>- Position (il faudra activer le GPS pour avoir une 
    localisation pr&#233;cise)<br>- SMS<br>- Stockage<br>- T&#233;l&#233;phone<br><br>SECURITE<br>Seuls 
    les SMS &#233;mis par une personne de votre r&#233;pertoire des contacts sont 
    accept&#233;s par l'application.<br>Une personne inconnue ne peut donc pas 
    r&#233;cup&#233;rer votre localisation.<br><br>Cette application est 
    gratuite, libre et sans publicit&#233;.<br>Les sources des programmes sont 
    disponibles ici <a href="https://github.com/pbillerot/teou">https://github.com/pbillerot/teou</a><br>C'est 
    une garantie du respect de la confidentialit&#233;.<br><br>Acc&#233;der &#224; la 
    documentation compl&#232;te<br><a href="https://github.com/pbillerot/teou/blob/master/readme.md">https://github.com/pbillerot/teou/blob/master/readme.md</a><br>

    <h3>
      <span><font color="#F44336">Pour commencer</font></span>
    </h3>
    <h3>
      <img src="images/teou_menu.png">
    </h3>
  </body>
</html>
